ChaosRealm/app/controllers/citizens_controller.rb

  def index
    @citizens = Citizen.all
---
SELECT "citizens".* FROM "citizens" WHERE (LOWER(display_name) LIKE '%text%')

  def create
    @citizen = Citizen.new(citizen_params)

    respond_to do |format|
      if @citizen.save
---
INSERT INTO "citizens" ("display_name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["display_name", "meep"], ["bio", "meep meep"], ["created_at", "2024-11-11 18:36:36.559155"], ["updated_at", "2024-11-11 18:36:36.559155"]]

  def update
    respond_to do |format|
      if @citizen.update(citizen_params)
---
UPDATE "citizens" SET "bio" = ?, "updated_at" = ? WHERE "citizens"."id" = ?  [["bio", "lalala"], ["updated_at", "2024-11-11 19:20:04.386844"], ["id", 3]]

  def destroy
    @citizen.destroy!
---
DELETE FROM "citizens" WHERE "citizens"."id" = ?  [["id", 4]]

    def set_citizen
      @citizen = Citizen.find(params[:id])
---
SELECT "citizens".* FROM "citizens" WHERE "citizens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]