ChaosRealm/app/controllers/forums_controller.rb

SELECT "citizens".* FROM "citizens" WHERE "citizens"."id" IN (?, ?)  [["id", 7], ["id", 8]]
SELECT "forums".* FROM "forums"
---
  def index
    #@forums = Forum.all
    @forums = Forum.includes(:citizen).all

INSERT INTO "forums" ("title", "description", "citizen_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Spoonville"], ["description", "NO KNIVES"], ["citizen_id", 7], ["created_at", "2024-11-15 21:34:32.323815"], ["updated_at", "2024-11-15 21:34:32.323815"]]
---
  def create
    @forum = current_citizen.forums.build(forum_params)
    if @forum.save

UPDATE "forums" SET "description" = ?, "updated_at" = ? WHERE "forums"."id" = ?  [["description", "please no errors??"], ["updated_at", "2024-11-18 00:01:46.278330"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @forum.update(forum_params)

DELETE FROM "forums" WHERE "forums"."id" = ?  [["id", 6]]
---
  def destroy
    @forum.destroy!

SELECT "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_forum
      @forum = Forum.find(params[:id])