ChaosRealm/app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "updated_at", "forum_id", "citizen_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2024-12-03 00:40:11.772493"], ["updated_at", "2024-12-03 00:40:11.772493"], ["forum_id", 4], ["citizen_id", 7]]
---
  def create
    @post = @forum.posts.build(post_params)
    @post.citizen = current_citizen

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2024-12-03 00:40:11.879752"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy
    @post.destroy!

SELECT "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_forum
      @forum = Forum.find(params[:forum_id])