ChaosRealm/app/views/forums/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."forum_id" = ?  [["forum_id", 12]]
SELECT 1 AS one FROM "posts" WHERE "posts"."forum_id" = ? LIMIT ?  [["forum_id", 12], ["LIMIT", 1]]
---
<h2>Posts</h2>
<% if @forum.posts.any? %>
      <% @forum.posts.each do |post| %>