ChaosRealm/app/views/citizens/show.html.erb

SELECT "forums".* FROM "forums" WHERE "forums"."citizen_id" = ?  [["citizen_id", 7]]
SELECT 1 AS one FROM "forums" WHERE "forums"."citizen_id" = ? LIMIT ?  [["citizen_id", 7], ["LIMIT", 1]]
---
<h2>My Forums</h2>
<% if @citizen.forums.any? %>
  <ul>
    <% @citizen.forums.each do |forum| %>